<template>
  <div>

    <div class="DownloadButton">
      <!-- <b-loading :is-full-page="isFullPage" :active.sync="isLoading" :can-cancel="true"></b-loading> -->
      <button class="button is-info DownloadButton" @click="printPDF">
          <b-icon icon="file-download"></b-icon> <span>ดาวโหลดไฟล์</span>
      </button>
    </div>

    <div style="display: flex; justify-content: center;" :key="key" v-for="(week, key) in project.scoreboard">
      <div id="pdf" class="box LayoutFrame">
        {{week}}
          <div>
            <div class="content" style="font-family: 'Sarabun', sans-serif; font-size: 17px;">
              <center><b class="font">รายงานความก้าวหน้าโครงงานพิเศษ ครั้งที่ {{key+1}}</b></center>
              <center><b class="font">{{thaiDate(week.endDate)}}</b></center><br><br>

              <b class="font">1. เป้าหมายที่ตั้งไว้ในสัปดาห์นี้ (สัปดาห์ที่ {{key+1}})</b><br>
              <b class="font" style="margin-left:20px">1.1 ความก้าวหน้า / ผลงานที่ดำเนินการมาแล้ว</b><br>
              <b class="font">..........................................................................................................................................................................</b><br>
              <b class="font">..........................................................................................................................................................................</b><br>
              <b class="font">..........................................................................................................................................................................</b><br>
              <b class="font">..........................................................................................................................................................................</b><br>
              <b class="font">..........................................................................................................................................................................</b><br><br>

              <b class="font" style="margin-left:20px">1.2 คิดเป็นร้อยละ {{week.progress}} ของงานทั้งหมด</b><br>
              <b class="font" style="margin-left:50px">จัดทำโครงงานได้ ตรงตามเป้าหมาย / น้อยกกว่าเป้าหมาย</b><br><br><br>

              <b class="font" style="margin-left:20px">1.3 ปัญหาที่พบ</b><br>
              <b class="font">..........................................................................................................................................................................</b><br>
              <b class="font">..........................................................................................................................................................................</b><br>
              <b class="font">..........................................................................................................................................................................</b><br>
              <b class="font">..........................................................................................................................................................................</b><br>
              <b class="font">..........................................................................................................................................................................</b><br><br><br>

              <b class="font" style="margin-left:20px">1.4 วิธีแก้ปัญหาที่พบ</b><br>
              <b class="font">..........................................................................................................................................................................</b><br>
              <b class="font">..........................................................................................................................................................................</b><br>
              <b class="font">..........................................................................................................................................................................</b><br>
              <b class="font">..........................................................................................................................................................................</b><br>
              <b class="font">..........................................................................................................................................................................</b><br><br><br>

              <b class="font" style="display: flex; justify-content: flex-end; ">......................... (ผู้จัดทำโครงการ)</b><br><br>
              <br>

              <b class="font">2. ความเห็นอาจารย์ที่ปรึกษา</b><br>
              <b class="font">..........................................................................................................................................................................</b><br>
              <b class="font">..........................................................................................................................................................................</b><br>
              <b class="font">..........................................................................................................................................................................</b><br>
              <b class="font">..........................................................................................................................................................................</b><br>
              <b class="font">..........................................................................................................................................................................</b><br><br>
              <b class="font" style="display: flex; justify-content: flex-end; ">......................... (อาจารย์ที่ปรึกษา)</b><br><br><br>

              <b class="font">3. ความเห็นอาจารย์ประจำวิชา</b><br>
              <b class="font">..........................................................................................................................................................................</b><br>
              <b class="font">..........................................................................................................................................................................</b><br>
              <b class="font">..........................................................................................................................................................................</b><br>
              <b class="font">..........................................................................................................................................................................</b><br>
              <b class="font">..........................................................................................................................................................................</b><br><br>
              <b class="font" style="display: flex; justify-content: flex-end; ">......................... (อาจารย์ประจำวิชา)</b><br><br><br>

            </div>
          </div>
      </div>

    </div>
  </div>
</template>

<script>
import db from '@/database'

export default {
  props: {
    projectId: {
      type: String,
      required: true
    }
  },
  data () {
    return {
      project: null
    }
  },
  methods: {
    printPDF () {},
    thaiDate (value) {
      const date = this.$dayjs(value)
      return date.format(`วันที่ DD เดือน MMMM พ.ศ. `) + (date.year() + 543)
    }
  },
  async created () {
    await db.database.ref(`/projects/${this.projectId}`).once('value', snapshot => {
      console.log(snapshot.val())
      this.project = snapshot.val()
    })
  }
}
</script>

<style scoped>
.LayoutFrame{
  margin-top: 50px;
  width: 870px;
  display: flex;
  justify-content: center;
  flex-direction: column;
  /* border-style: double; */
  padding: 0px;
  min-width: 870px;
}

.logoKMUTNB{
  display: flex;
  justify-content: flex-start;
  margin-left: 60px;
  margin-top: 20px;
  margin-bottom: 20px;
}
.topBorder{
  padding: 5px;
  border-style: hidden hidden double hidden;
}
.footerBorder{
  display: flex;
  border-style: double hidden hidden hidden;
}
.CommentBorder{
  border-style: hidden double hidden hidden;
  font-family: 'THSarabunNew', sans-serif;
}
.topTitle{
  margin-left: 120px;
  margin-top: -175px;
}
.content{
  padding: 30px;
  margin-left: 50px;
}
.font{
  font-family: 'Sarabun', sans-serif;
}
.DownloadButton{
  display: flex;
  justify-content: flex-end;
  margin-top: 10px;
  margin-right: 60px;
}
</style>
